RIET/src/Reports/РегистрУчетаДоговоровНаДобровольноеСтрахование/РегистрУчетаДоговоровНаДобровольноеСтрахование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РегистрУчетаДоговоровНаДобровольноеСтрахование</name>
  <comment>(регл)</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

RIET/src/AccountingRegisters/Налоговый/Налоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Налоговый</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Налоговый</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчетаПоПБУ18</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

RIET/src/Enums/ВидыРБП/ВидыРБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРБП</name>
  <enumValues>
    <name>ОсвоениеПриродныхРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ДолгосрочноеСтрахованиеЖизни</name>
  </enumValues>
  <enumValues>
    <name>СтрахованиеНаОплатуМедицинскихРасходов</name>
  </enumValues>
  <enumValues>
    <name>СтрахованиеНаСлучайСмертиИУтратыРаботоспособности</name>
  </enumValues>
  <enumValues>
    <name>ОтрицательныйРезультатОтРеализацииАмортизируемогоИмущества</name>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ВидыУчетаПоПБУ18/ВидыУчетаПоПБУ18.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУчетаПоПБУ18</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>НУ</name>
    <comment>Налоговый учет</comment>
  </enumValues>
  <enumValues>
    <name>ПР</name>
    <comment>Учет постоянных разниц</comment>
  </enumValues>
  <enumValues>
    <name>ВР</name>
    <comment>Учет временных разниц</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Reports/РегистрУчетаДоговоровНаДобровольноеСтрахование/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт

	НачалоПериода = НачалоМесяца(ДатаНач);
	КонецПериода = КонецМесяца(ДатаКон);

	ДокументРезультат.Очистить();

	Макет = ПолучитьМакет("Отчет");

	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");

	ОбластьЗаголовок.Параметры.НачалоПериода       = Формат(НачалоПериода, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.КонецПериода        = Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное;
	ОбластьЗаголовок.Параметры.ИННОрганизации      = "" + Организация.ИНН + " / " + Организация.КПП;
	ДокументРезультат.Вывести(ОбластьЗаголовок);

	// Параметр для показа заголовка
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;

	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;

	Страхование1 = Перечисления.ВидыРБП.ДолгосрочноеСтрахованиеЖизни;
	Страхование2 = Перечисления.ВидыРБП.СтрахованиеНаОплатуМедицинскихРасходов;
	Страхование3 = Перечисления.ВидыРБП.СтрахованиеНаСлучайСмертиИУтратыРаботоспособности;
	
	ВидыРБП = Новый Массив;
	ВидыРБП.Добавить(Страхование1);
	ВидыРБП.Добавить(Страхование2);
	ВидыРБП.Добавить(Страхование3);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	Запрос.УстановитьПараметр("Счет",          ПланыСчетов.Налоговый.РасходыБудущихПериодовНаДобровольноеСтрахованиеРаботников);
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("ВидУчета",      Перечисления.ВидыУчетаПоПБУ18.НУ);
	Запрос.УстановитьПараметр("ВидРБП",        ВидыРБП);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалоговыйДвиженияССубконто.Период КАК ДатаОперации,
	|	НалоговыйДвиженияССубконто.СубконтоДт1 КАК РБП,
	|	НалоговыйДвиженияССубконто.СубконтоДт1.ВидРБП КАК ВидРБП,
	|	НалоговыйДвиженияССубконто.СубконтоДт2 КАК Работник,
	|	РаботникиОрганизацииСрезПоследних.ТабельныйНомер КАК ТабельныйНомер,
	|	НалоговыйДвиженияССубконто.СубконтоДт1.ДатаНачалаСписания КАК ДатаНачала,
	|	НалоговыйДвиженияССубконто.СубконтоДт1.ДатаОкончанияСписания КАК ДатаЗавершения,
	|	НалоговыйДвиженияССубконто.Сумма КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Налоговый.ДвиженияССубконто(
	|		&НачалоПериода,
	|		&КонецПериода,
	|		СчетДт = &Счет
	|		    И Организация = &Организация
	|		    И Активность = Истина
	|		    И ВидУчетаДт = &ВидУчета 
	|           И СубконтоДт1.ВидРБП В(&ВидРБП)) КАК НалоговыйДвиженияССубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, ) КАК РаботникиОрганизацииСрезПоследних
	|		ПО НалоговыйДвиженияССубконто.СубконтоДт2 = РаботникиОрганизацииСрезПоследних.Физлицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОперации";

	Результат = Запрос.Выполнить().Выбрать();

	ОбластьПодвал        = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока        = Макет.ПолучитьОбласть("Строка");

	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);

	Пока Результат.Следующий() Цикл

		Если (НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(Результат.ДатаНачала)) 
		   И (НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(Результат.ДатаЗавершения))
		   И (Результат.ДатаНачала <= Результат.ДатаЗавершения) Тогда

			КоличествоМесяцев = (Год(Результат.ДатаЗавершения) - Год(Результат.ДатаНачала)) * 12;
			КоличествоМесяцев = КоличествоМесяцев + Месяц(Результат.ДатаЗавершения) - Месяц(Результат.ДатаНачала);

			Если День(Результат.ДатаНачала) - День(Результат.ДатаЗавершения) <= 1 Тогда
				КоличествоМесяцев = КоличествоМесяцев + 1;
			КонецЕсли;

		Иначе
			КоличествоМесяцев = "";

		КонецЕсли;

		ПредставлениеВидаРБП = "";

		Если Результат.ВидРБП = Страхование1 Тогда
			ПредставлениеВидаРБП = "Долгосрочное страхование жизни работников, пенсионное страхование, негосударственное пенсионное обеспечение работников";

		ИначеЕсли Результат.ВидРБП = Страхование2 Тогда
			ПредставлениеВидаРБП = "Добровольное личное страхование, предусматривающее оплату страховщиками медицинских расходов";

		ИначеЕсли Результат.ВидРБП = Страхование3 Тогда
			ПредставлениеВидаРБП = "Добровольное личное страхование, заключаемое исключительно на случай наступления смерти или утраты трудоспособности";

		КонецЕсли;

		ОбластьСтрока.Параметры.ДатаФормированияЗаписи            = Результат.ДатаОперации;
		ОбластьСтрока.Параметры.ВидСтрахования                    = ПредставлениеВидаРБП;
		ОбластьСтрока.Параметры.Работник                          = Строка(Результат.Работник) + " (таб.№ " + Результат.ТабельныйНомер + ")";
		ОбластьСтрока.Параметры.ДатаПрекращенияДействияДоговора   = Результат.ДатаЗавершения;
		ОбластьСтрока.Параметры.КоличествоМесяцевДействияДоговора = КоличествоМесяцев;
		ОбластьСтрока.Параметры.СуммаПлатежа                      = Результат.Сумма;
		ДокументРезультат.Вывести(ОбластьСтрока);

	КонецЦикла;

	СтруктураЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, ДатаКон);
	ОбластьПодвал.Параметры.ОтветственныйЗаРегистры = СтруктураЛиц.ОтветственныйЗаРегистры;

	ДокументРезультат.Вывести(ОбластьПодвал);

КонецПроцедуры // СформироватьОтчет

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

#КонецЕсли
